In [1]:
import pandas as pd

In [3]:
dict1 = {'a':[11,2,3,4,2], 'b':[14,15,16,17,18]}
df = pd.DataFrame(dict1, index=['i1','i2','i3','i4','i5'])
df

     a   b
i1  11  14
i2   2  15
i3   3  16
i4   4  17
i5   2  18

In [6]:
df['a'].unique()

array([11,  2,  3,  4], dtype=int64)

In [8]:
df['a'].nunique()

4

In [14]:
df.describe()

               a          b
count   5.000000   5.000000
mean    4.400000  16.000000
std     3.781534   1.581139
min     2.000000  14.000000
25%     2.000000  15.000000
50%     3.000000  16.000000
75%     4.000000  17.000000
max    11.000000  18.000000

In [15]:
df['a'].value_counts()

2     2
4     1
3     1
11    1
Name: a, dtype: int64

In [17]:
def mult(x):
    return x*2

In [19]:
df

     a   b
i1  11  14
i2   2  15
i3   3  16
i4   4  17
i5   2  18

In [18]:
df.apply(mult)

     a   b
i1  22  28
i2   4  30
i3   6  32
i4   8  34
i5   4  36

In [20]:
df['a'].apply(mult)

i1    22
i2     4
i3     6
i4     8
i5     4
Name: a, dtype: int64

In [21]:
df['b'].apply(mult)

i1    28
i2    30
i3    32
i4    34
i5    36
Name: b, dtype: int64

In [22]:
df.apply(lambda n: n*5)

     a   b
i1  55  70
i2  10  75
i3  15  80
i4  20  85
i5  10  90

In [23]:
df.columns

Index(['a', 'b'], dtype='object')

In [24]:
df.index

Index(['i1', 'i2', 'i3', 'i4', 'i5'], dtype='object')

In [30]:
df.sort_values('b')

     a   b
i1  11  14
i2   2  15
i3   3  16
i4   4  17
i5   2  18

In [31]:
df['a'].sort_values()

i2     2
i5     2
i3     3
i4     4
i1    11
Name: a, dtype: int64